docs: cleaner README and fixed typo
